DataProcessors/ПодключениеАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПодключениеАУСН</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКорпоративныхРасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБанк</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпискаЗагружаетсяПоДепозитномуСчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЦифровогоСчета</Name>
					<Comment>Идентификатор счета цифрового рубля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиИнтеграцииСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиИнтеграцииСБанками</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГиперссылкаДляПереходаКСпискуПлатежей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Банки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПодключениеАУСН/Forms/ПомощникПодключения/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КодЗаявкиВведенныйТекст;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Организация = Параметры.Организация;
	ОбменСФНСПодключен = Параметры.ОбменСФНСПодключен;
	
	АдресДополнительныхПараметров = Параметры.АдресДополнительныхПараметров;
	
	Если ЭтоАдресВременногоХранилища(АдресДополнительныхПараметров) Тогда
		
		ПараметрыПодключения = ПолучитьИзВременногоХранилища(АдресДополнительныхПараметров);
		
		ТаблицаОписанияСервисов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ПараметрыПодключения, "ОписанияСервисов");
		
		Если ТаблицаОписанияСервисов <> Неопределено Тогда
			ОписанияСервисов.Загрузить(ТаблицаОписанияСервисов);
		КонецЕсли;
		
		ТаблицаУполномоченныхБанков = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ПараметрыПодключения, "УполномоченныеБанки");
		
		Если ТаблицаУполномоченныхБанков <> Неопределено Тогда
			УполномоченныеБанки.Загрузить(ТаблицаУполномоченныхБанков);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбменСФНСПодключен Тогда
		СостояниеФормы = ВсеСостоянияФормы().Подключение;
	Иначе
		СостояниеФормы = ВсеСостоянияФормы().ВыборПодключения;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораБанка();
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если ЭтоПодключениеБанка(ТипПодключения) Тогда
		Если Не ЗначениеЗаполнено(Банк) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , "Заполнение", НСтр("ru = 'Банк'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Банк", , Отказ);
		ИначеЕсли Не ЗначениеЗаполнено(КодЗаявки) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , "Заполнение", НСтр("ru = 'Код заявки'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "КодЗаявки", , Отказ);
		ИначеЕсли СтрДлина(КодЗаявки) <> ДлинаКодаЗаявки() Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , "Корректность", НСтр("ru = 'Код заявки'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "КодЗаявки", , Отказ);
		ИначеЕсли Не КодЗаявкиПроверен Тогда
			ТекстСообщения = НСтр("ru = 'Заявка не найдена. Проверьте правильность заполнения.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "КодЗаявки", , Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЖурналРегистрации" Тогда
		СтандартнаяОбработка = Ложь;
		Если ОбщегоНазначенияБПВызовСервера.ДоступенПросмотрЖурналаРегистрации() Тогда
			ИнтеграцияАУСНКлиент.ОткрытьЖурналРегистрации(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Ошибка"));
		Иначе
			ТекстСообщения = НСтр("ru = 'Просмотр журнала регистрации запрещен.
				|Обратитесь к администратору для выяснения причины возникновения ошибки подключения к сервису АУСН.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Портал1С" Тогда
		СтандартнаяОбработка = Ложь;
		ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта(
			ИнтеграцияАУСНКлиентСервер.СсылкаНаПорталСКлючамиДоступа());
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЛКАУСН" Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке(ИнтеграцияАУСНКлиентСервер.СсылкаНаЗаявкуВЛичномКабинетеАУСН());
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ШаблонОбращенияВБанк" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ОткрытьФорму("Обработка.ПодключениеАУСН.Форма.ШаблонОбращенияВБанк", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПодключениеДиректБанк" Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСБанкамиКлиент.ОткрытьНастройкиDirectBankСОтбором(Банк);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "БанковскиеОперацииАУСН" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("БанковскийСчет", БанковскийСчет);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии",  Истина);
		ОткрытьФорму("Отчет.БанковскиеОперацииАУСН.Форма", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПодключитьОбменСФНС" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ОткрытьФорму("Обработка.ПодключениеАУСН.Форма.ФормаПодключениеФНС", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодключенСервисФНС" Тогда
		ОбменСФНСПодключен = Истина;
		УправлениеФормой(ЭтотОбъект);
	ИначеЕсли ИмяСобытия = "ИзмененаНастройкаОбменСБанками" Тогда
		Если Параметр.Организация = Организация Тогда
			ДиректБанкПодключен = Не Параметр.Недействительна;
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = ИнтеграцияАУСНКлиентСервер.ИмяСобытияПроверенКлючДоступа() И Источник = ЭтотОбъект Тогда
		ОбработатьРезультатПроверкиКлючаДоступа(Параметр);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЗавершениеРаботы Тогда
		ВсеСостоянияФормы = ВсеСостоянияФормы();

		Если СостояниеФормы = ВсеСостоянияФормы.Подключено Тогда
			Если ЭтоПодключениеБанка(ТипПодключения) Тогда
				УстановитьЗначениеПередачиРасчетаНДФЛ(Организация, ПередачаРасчетаНДФЛ, Банк);
			Иначе
				УстановитьЗначениеПередачиРасчетаНДФЛ(Организация, ПередачаРасчетаНДФЛ);
			КонецЕсли;
			Оповестить("ИнтеграцияАУСН_ИзмененаПередачаРасчетаНДФЛ");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БанкПриИзменении(Элемент)

	БанкОбработатьИзменение();

КонецПроцедуры

&НаКлиенте
Процедура КакПолучитьКодЗаявкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	ИнтеграцияАУСНФормыКлиент.ПодсказкаПолучениеКодаЗаявкиОбработкаНавигационнойСсылки(
		ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура КодЗаявкиПриИзменении(Элемент)

	КодЗаявкиОбработатьИзменение();

КонецПроцедуры

&НаКлиенте
Процедура КодЗаявкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	КодЗаявкиВведенныйТекст = СокрЛП(Текст);
	
	ПодключитьОбработчикОжидания("Подключаемый_НайтиЗаявку", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура БанкНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СписокБанков = Новый Массив;
	
	Для Каждого УполномоченныйБанк Из УполномоченныеБанки Цикл
		СписокБанков.Добавить(УполномоченныйБанк.Банк);
	КонецЦикла;
	
	ПараметрыОткрываемойФормы = Новый Структура;
	ОтборОткрываемойФормы = Новый Структура;
	ОтборОткрываемойФормы.Вставить("Ссылка", СписокБанков);
	ПараметрыОткрываемойФормы.Вставить("Отбор", ОтборОткрываемойФормы);
	ПараметрыОткрываемойФормы.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);
	
	ОткрытьФорму(
		"Справочник.КлассификаторБанков.ФормаВыбора",
		ПараметрыОткрываемойФормы,
		Элемент,
		УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)

	ОбработатьПереходДалее();

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	ОбработатьПереходНазад();

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявку(Команда)

	Если ПроверитьЗаполнение() Тогда
		ТекстВопроса = НСтр("ru = 'Код заявки одноразовый, поэтому после ее отклонения повторное подключение будет недоступно.
			|Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОтклонитьЗаявкуПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	
	ТекстВопроса = НСтр("ru = 'После отключения сервиса обмен данными по разметке операций и передача расчета НДФЛ в банк будут прекращены.
		|Продолжить?'");
	Оповещение = Новый ОписаниеОповещения("ОтключитьБанкПослеВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)

	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьПодключениеСервиса");
	ПроверитьПодключениеСервиса();

КонецПроцедуры

&НаКлиенте
Процедура Повторить(Команда)

	Если Не ЗначениеЗаполнено(КлючДоступа) Тогда
		СостояниеФормы = ВсеСостоянияФормы().ТребуетКлючаДоступа;
	Иначе
		СостояниеФормы = ВсеСостоянияФормы().Ожидание;
		ПривязатьНалогоплательщикаКВУС();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьЗаявку(Команда)

	Если ПроверитьЗаполнение() Тогда
		ВыполнитьМетодВФоне("ПодтвердитьЗаявку");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаПодключение(Команда)
	
	Если Не ЗначениеЗаполнено(КлючДоступа) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверятьСостояниеКлюча = ИнтеграцияАУСНКлиентСервер.ПроверятьСостояниеКлюча();
	Если Не ИнтеграцияАУСНКлиентСервер.КлючДоступаСоответствуетТребованиям(КлючДоступа)
		Или (Не ПроверятьСостояниеКлюча И Не КлючДоступаДействителен(Организация, КлючДоступа)) Тогда
		Элементы.ПодсказкаКлючДоступа.Видимость = Истина;
		Возврат;
	КонецЕсли;
	Элементы.ПодсказкаКлючДоступа.Видимость = Ложь;
	
	ЗаписатьТокенПорталаАУСННаСервере(Организация, КлючДоступа);
	
	СостояниеФормы = ВсеСостоянияФормы().Ожидание;
	УправлениеФормой(ЭтотОбъект);
	
	Если ПроверятьСостояниеКлюча Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбработатьОтправкуЗапросаНаПодключение", 0.1, Истина);
	Иначе
		ВыполнитьМетодПодключения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	СостояниеФормы = Форма.СостояниеФормы;
	ВсеСостоянияФормы = ВсеСостоянияФормы();
	
	ПоказыватьКомандуНазад = СостояниеФормы = ВсеСостоянияФормы.ТребуетКлючаДоступа
		Или СостояниеФормы = ВсеСостоянияФормы.Подключение
		Или СостояниеФормы = ВсеСостоянияФормы.Ошибка;
	ПоказыватьКомандуДалее = СостояниеФормы = ВсеСостоянияФормы.ВыборПодключения;
	ПоказыватьКомандуГотово = СостояниеФормы = ВсеСостоянияФормы.Подключено;
	ПоказыватьКомандуПодтвердить = СостояниеФормы = ВсеСостоянияФормы.Подключение;
	ПоказыватьКомандуОтправитьЗапрос = СостояниеФормы = ВсеСостоянияФормы.ТребуетКлючаДоступа;
	ПоказыватьКомандуПроверитьПодключение = СостояниеФормы = ВсеСостоянияФормы.ТребуетПодтверждения;
	ПоказыватьКомандуПовторить = СостояниеФормы = ВсеСостоянияФормы.Ошибка;
	ПоказыватьКомандуЗакрыть = СостояниеФормы = ВсеСостоянияФормы.ТребуетПодтверждения
		Или СостояниеФормы = ВсеСостоянияФормы.Ошибка
		Или СостояниеФормы = ВсеСостоянияФормы.ЗаявкаОтклонена;
	
	Если СостояниеФормы = ВсеСостоянияФормы.Ожидание Тогда
		
		Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
		Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Ложь;
		Элементы.СтраницаБанкПодключение.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОжидание;
		
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.ВыборПодключения Тогда
		
		Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
		Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Ложь;
		Элементы.СтраницаБанкПодключение.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборПодключения;
		
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.Подключение Тогда
		
		Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
		Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Ложь;
		Элементы.СтраницаБанкПодключение.Видимость = Истина;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаБанкПодключение;
		
		БанкВыбран = ЗначениеЗаполнено(Форма.Банк);
		
		Если БанкВыбран Тогда
			БанкПодключен = Ложь;
			НаименованиеБанка = "";
			СтруктураПоиска = Новый Структура("Банк", Форма.Банк);
			СтрокиУполномоченныхБанков = Форма.УполномоченныеБанки.НайтиСтроки(СтруктураПоиска);
			Если СтрокиУполномоченныхБанков.Количество() > 0 Тогда
				НаименованиеБанка = СтрокиУполномоченныхБанков[0].Наименование;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("Сервис", Форма.Банк);
			СтрокиОписанияСервисов = Форма.ОписанияСервисов.НайтиСтроки(СтруктураПоиска);
			ВыбранИнтегрированныйБанк = СтрокиОписанияСервисов.Количество() > 0;
			
			Если ВыбранИнтегрированныйБанк Тогда
				СостояниеИнтеграции = СостояниеИнтеграции(Форма.Организация, Форма.Банк);
				БанкПодключен =
					СостояниеИнтеграции = ПредопределенноеЗначение("Перечисление.СостоянияИнтеграцииАУСН.Подключено");
				
				Элементы.ЗаголовокБанкПодключен.Заголовок = СтрШаблон(НСтр("ru = '%1 подключен'"), НаименованиеБанка);
			Иначе
				Элементы.ДекорацияОписаниеНеинтегрированногоБанка.Заголовок = ОписаниеНеинтегрированногоБанка(НаименованиеБанка);
				Элементы.ДекорацияОписаниеКорректировкаРазметки.Заголовок = ОписаниеПодсказкиКорректировкиРазметки();
				
				Элементы.ГруппаПодключениеДиректБанка.Видимость = Не Форма.ДиректБанкПодключен;
				Элементы.ГруппаДиректБанкПодключен.Видимость = Форма.ДиректБанкПодключен;
				
				Элементы.ГруппаПодключениеОбменаСФНС.Видимость = Не Форма.ОбменСФНСПодключен;
				Элементы.ГруппаОбменСФНСПодключен.Видимость = Форма.ОбменСФНСПодключен;
			КонецЕсли;
			
			Элементы.ГруппаИнтегрированныйБанкПодключен.Видимость = ВыбранИнтегрированныйБанк И БанкПодключен;
			Элементы.ГруппаИнтегрированныйБанкПодключение.Видимость = ВыбранИнтегрированныйБанк И Не БанкПодключен;
			Элементы.ГруппаОписаниеНеинтегрированногоБанка.Видимость = Не ВыбранИнтегрированныйБанк;
			
			ПоказыватьКомандуНазад = Не Форма.ОбменСФНСПодключен;
			ПоказыватьКомандуПодтвердить = ВыбранИнтегрированныйБанк И Не БанкПодключен;
			ПоказыватьКомандуЗакрыть = Не ВыбранИнтегрированныйБанк Или БанкПодключен;
		Иначе
			Элементы.ГруппаИнтегрированныйБанкПодключен.Видимость = Ложь;
			Элементы.ГруппаИнтегрированныйБанкПодключение.Видимость = Ложь;
			Элементы.ГруппаОписаниеНеинтегрированногоБанка.Видимость = Ложь;
			
			ПоказыватьКомандуПодтвердить = Ложь;
			ПоказыватьКомандуЗакрыть = Истина;
		КонецЕсли;
		
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.ЗаявкаОтклонена Тогда
		
		Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
		Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаБанкЗаявкаОтклонена;
		
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.ТребуетКлючаДоступа Тогда
		
		Элементы.СтраницаФНСКлючДоступа.Видимость = Истина;
		Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФНСКлючДоступа;
		
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.ТребуетПодтверждения Тогда
		
		Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
		Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Истина;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФНСПодтверждениеЗаявки;
		
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.Ошибка Тогда
		
		Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
		Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		
		ПоказыватьКомандуПовторить = ЭтоПодключениеФНС(Форма.ТипПодключения);
		
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.Подключено Тогда
		
		ВключенаПередачаНДФЛ = ВключенаПередачаНДФЛИзПрограммы(Форма.Организация);
		ЭтоПодключениеБанка = ЭтоПодключениеБанка(Форма.ТипПодключения);
		
		Если ЭтоПодключениеБанка Тогда
			Элементы.СтраницыОбменПодключен.ТекущаяСтраница = Элементы.СтраницаПодключенБанк;
			
			БанкиБезПередачиНДФЛ = БанкиНеПоддерживающиеПередачуНДФЛ();
			ВозможнаПередачаНДФЛ = БанкиБезПередачиНДФЛ.Найти(Форма.Банк) = Неопределено;
			
			Элементы.ПередачаРасчетаНДФЛБанк.Видимость = Не ВключенаПередачаНДФЛ И ВозможнаПередачаНДФЛ;
			СтруктураПоиска = Новый Структура("Сервис", Форма.Банк);
			СтрокиОписанияСервисов = Форма.ОписанияСервисов.НайтиСтроки(СтруктураПоиска);
			Если СтрокиОписанияСервисов.Количество() > 0 Тогда
				Элементы.ПередачаРасчетаНДФЛБанк.Заголовок =
					СтрШаблон(НСтр("ru = 'Передавать расчет НДФЛ через %1'"), СтрокиОписанияСервисов[0].ИмяСервиса);
			КонецЕсли;
			
			Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
			Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Ложь;
		Иначе
			Элементы.СтраницыОбменПодключен.ТекущаяСтраница = Элементы.СтраницаПодключенФНС;
			Элементы.ПередачаРасчетаНДФЛБанк.Видимость = Не ВключенаПередачаНДФЛ;
			Элементы.СтраницаФНСКлючДоступа.Видимость = Ложь;
			Элементы.СтраницаФНСПодтверждениеЗаявки.Видимость = Истина;
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодключено;
		
	КонецЕсли;
	
	Элементы.ФормаНазад.Видимость = ПоказыватьКомандуНазад;
	Элементы.ФормаДалее.Видимость = ПоказыватьКомандуДалее;
	Элементы.ФормаПодтвердитьЗаявку.Видимость = ПоказыватьКомандуПодтвердить;
	Элементы.ФормаОтправитьЗапросНаПодключение.Видимость = ПоказыватьКомандуОтправитьЗапрос;
	Элементы.ФормаПроверитьПодключение.Видимость = ПоказыватьКомандуПроверитьПодключение;
	Элементы.Повторить.Видимость = ПоказыватьКомандуПовторить;
	Элементы.ФормаГотово.Видимость = ПоказыватьКомандуГотово;
	Элементы.ФормаЗакрыть.Видимость = ПоказыватьКомандуЗакрыть;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСостояниеФормы(СостояниеФормы, Форма)
	
	Форма.СостояниеФормы = СостояниеФормы;
	УправлениеФормой(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВсеСостоянияФормы()

	Результат = Новый Структура;
	Результат.Вставить("Ожидание", "Ожидание фоновой операции");
	Результат.Вставить("ВыборПодключения", "Выбор варианта подключения");
	Результат.Вставить("Подключение", "Подключение обмена с банком");
	Результат.Вставить("ЗаявкаОтклонена", "Заявка отклонена");
	Результат.Вставить("ТребуетКлючаДоступа", "ТребуетКлючаДоступа");
	Результат.Вставить("ТребуетПодтверждения", "Требует подтверждения в личном кабинете");
	Результат.Вставить("Ошибка", "Ошибка");
	Результат.Вставить("Подключено", "Подключено");
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОбработатьПереходДалее()
	
	ВсеСостоянияФормы = ВсеСостоянияФормы();
	
	Если СостояниеФормы = ВсеСостоянияФормы.ВыборПодключения Тогда
		Если ЭтоПодключениеБанка(ТипПодключения) Тогда
			УстановитьСостояниеФормы(ВсеСостоянияФормы.Подключение, ЭтотОбъект);
		ИначеЕсли ЭтоПодключениеФНС(ТипПодключения) Тогда
			УстановитьСостояниеФормы(ВсеСостоянияФормы.ТребуетКлючаДоступа, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПереходНазад()
	
	ВсеСостоянияФормы = ВсеСостоянияФормы();
	
	Если СостояниеФормы = ВсеСостоянияФормы.Подключение
		Или СостояниеФормы = ВсеСостоянияФормы.ТребуетКлючаДоступа Тогда
		УстановитьСостояниеФормы(ВсеСостоянияФормы.ВыборПодключения, ЭтотОбъект);
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы.Ошибка Тогда
		Если ЭтоПодключениеБанка(ТипПодключения) Тогда
			ВернутьсяКПодключениюБанка();
		ИначеЕсли ЭтоПодключениеФНС(ТипПодключения) Тогда
			ОчиститьКлючДоступаНаСервере(Организация);
			КлючДоступа = "";
			УстановитьСостояниеФормы(ВсеСостоянияФормы.ТребуетКлючаДоступа, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БанкОбработатьИзменение()
	
	КодЗаявки = "";
	КодЗаявкиОбработатьИзменение();
	
	ДанныеБанка = ДанныеБанка(Организация, Банк);
	ЛичныйКабинетБанка  = ДанныеБанка.ЛичныйКабинет;
	ИдентификаторБанка  = ДанныеБанка.Идентификатор;
	БанковскийСчет      = ДанныеБанка.БанковскийСчет;
	ДиректБанкПодключен = ДанныеБанка.ДиректБанкПодключен;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораБанка()
	
	ВыбранныйБанк = Банк;
	
	КартинкаБанкПодключен = БиблиотекаКартинок.СветофорЗеленый;
	КартинкаИнтегрированныйБанк = БиблиотекаКартинок.СветофорЖелтый;
	КартинкаУполномоченныйБанк = БиблиотекаКартинок.СветофорСерый;
	
	СписокВыбораБанка = Элементы.Банк.СписокВыбора;
	СписокВыбораБанка.Очистить();
	
	Для Каждого СтрокаУполномоченныйБанк Из УполномоченныеБанки Цикл
		
		Если Не СтрокаУполномоченныйБанк.ВыводитьДляВыбора Тогда
			Продолжить;
		КонецЕсли;
		
		КартинкаПредставлениеБанка = КартинкаУполномоченныйБанк;
		
		Если СтрокаУполномоченныйБанк.Подключен Тогда
			КартинкаПредставлениеБанка = КартинкаБанкПодключен;
		ИначеЕсли СтрокаУполномоченныйБанк.ВозможноПодключить Тогда
			КартинкаПредставлениеБанка = КартинкаИнтегрированныйБанк;
		КонецЕсли;
		
		СписокВыбораБанка.Добавить(
			СтрокаУполномоченныйБанк.Банк, , , КартинкаПредставлениеБанка);
		
		ЗаполнитьВыборБанка = Не ЗначениеЗаполнено(ВыбранныйБанк) И СтрокаУполномоченныйБанк.ВозможноПодключить
			И Не СтрокаУполномоченныйБанк.Подключен И СтрокаУполномоченныйБанк.ЕстьРасчетныйСчет;
		
		Если ЗаполнитьВыборБанка Тогда
			ВыбранныйБанк = СтрокаУполномоченныйБанк.Банк;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Банк <> ВыбранныйБанк Тогда
		Банк = ВыбранныйБанк;
		ДанныеБанка = ДанныеБанка(Организация, Банк);
		ЛичныйКабинетБанка  = ДанныеБанка.ЛичныйКабинет;
		ИдентификаторБанка  = ДанныеБанка.Идентификатор;
		БанковскийСчет      = ДанныеБанка.БанковскийСчет;
		ДиректБанкПодключен = ДанныеБанка.ДиректБанкПодключен;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодЗаявкиОбработатьИзменение()
	
	КодЗаявки = СокрЛП(КодЗаявки);
	
	ИнтеграцияАУСНФормыКлиент.ОбработатьИзменениеКодаЗаявки(ЭтотОбъект, КодЗаявки);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НайтиЗаявку()
	
	ДлинаВведенногоКодаЗаявки = СтрДлина(КодЗаявкиВведенныйТекст);
	
	КодЗаявкиПодсказка = ИнтеграцияАУСНФормыКлиент.ПодсказкаКодаЗаявки(КодЗаявкиВведенныйТекст);
	
	Если ДлинаВведенногоКодаЗаявки = ДлинаКодаЗаявки() Тогда
		ВыполнитьМетодВФоне("НайтиЗаявку");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДлинаКодаЗаявки()
	
	Возврат 36;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеБанка(Знач Организация, Знач Банк)
	
	Данные = НовыйДанныеБанка();
	Данные.ЛичныйКабинет = ИнтеграцияАУСНПовтИсп.СсылкаЛичныйКабинетБанка(Банк);
	Данные.Идентификатор = ИнтеграцияАУСНПовтИсп.ИдентификаторБанкаПоКлассификатору(Банк);
	Данные.БанковскийСчет = Обработки.ПодключениеАУСН.БанковскийСчетОрганизации(Организация, Банк);
	Данные.ДиректБанкПодключен = БанковскийСчетПодключенКДиректБанк(Организация, Данные.БанковскийСчет);
	
	Возврат Данные;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйДанныеБанка()
	
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("ЛичныйКабинет", "");
	Данные.Вставить("БанковскийСчет", Справочники.БанковскиеСчета.ПустаяСсылка());
	Данные.Вставить("ДиректБанкПодключен", Ложь);
	
	Возврат Данные;
	
КонецФункции

&НаСервереБезКонтекста
Функция БанковскийСчетПодключенКДиректБанк(Организация, БанковскийСчет)
	
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	БанкРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "Банк");
	
	НастройкаОбмена = ОбменСБанками.НастройкаОбмена(Организация, БанкРасчетногоСчета);
	
	УстановитьПривилегированныйРежим(Истина);
	ВключенаИнтеграцияСБанком = ЗначениеЗаполнено(БанкРасчетногоСчета)
		И Справочники.НастройкиИнтеграцииСБанками.НастройкаИнтеграцииОрганизацииСБанком(Организация, БанкРасчетногоСчета) <> Неопределено;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВключенаИнтеграцияСБанком И ЗначениеЗаполнено(НастройкаОбмена);
	
КонецФункции

&НаСервереБезКонтекста
Функция СостояниеИнтеграции(Знач Организация, Знач Банк)
	
	Возврат РегистрыСведений.СостоянияИнтеграцииАУСН.СостояниеИнтеграции(Организация, Банк);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВключенаПередачаНДФЛИзПрограммы(Организация)
	
	Возврат РегистрыСведений.СостоянияИнтеграцииАУСН.МожемПередатьНДФЛИзПрограммы(Организация);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеНеинтегрированногоБанка(НаименованиеБанка)
	
	СтрокаОписание = НСтр("ru = 'Автоматический обмен с %1 пока не поддерживается.
	|
	|По вопросам интеграции %1 с 1С вы можете написать в поддержку банка, для удобства воспользуйтесь <a href=""ШаблонОбращенияВБанк"">Шаблоном обращения</a>.
	|
	|Если используется АУСН %1:'");
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат СтроковыеФункции.ФорматированнаяСтрока(СтрокаОписание, НаименованиеБанка);
	#Иначе
		Возврат СтроковыеФункцииКлиент.ФорматированнаяСтрока(СтрокаОписание, НаименованиеБанка);
	#КонецЕсли
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеПодсказкиКорректировкиРазметки()
	
	Если ОбщегоНазначенияБПВызовСервера.ЭтоПростойИнтерфейс() Тогда
		ПутьКОтчету = НСтр("ru = 'Налоги - Банковские операции АУСН'");
	Иначе
		ПутьКОтчету = НСтр("ru = 'Отчеты - Банковские операции АУСН'");
	КонецЕсли;
	
	СтрокаОписание = НСтр("ru = 'Корректируйте разметку банковских операций в личном кабинете банка, сверяясь с отчетом в разделе <a href=""БанковскиеОперацииАУСН"">%1</a>'");
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат СтроковыеФункции.ФорматированнаяСтрока(СтрокаОписание, ПутьКОтчету);
	#Иначе
		Возврат СтроковыеФункцииКлиент.ФорматированнаяСтрока(СтрокаОписание, ПутьКОтчету);
	#КонецЕсли
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьСостояниеИнтеграцииЛКАУСН(Организация, СостояниеИнтеграции)
	
	РегистрыСведений.СостоянияИнтеграцииАУСН.ЗаписатьСостояниеИнтеграцииЛКАУСН(Организация, СостояниеИнтеграции);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеПередачиРасчетаНДФЛ(Организация, ПередачаНДФЛ, Сервис = Неопределено)
	
	Если Сервис = Неопределено Тогда
		Сервис = Справочники.КлассификаторБанков.ПустаяСсылка();
	КонецЕсли;
	
	РегистрыСведений.СостоянияИнтеграцииАУСН.ИзменитьНастройкиПередачиНДФЛ(Организация, Сервис, ПередачаНДФЛ);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПодключениеБанка(ТипПодключения)
	
	Возврат ТипПодключения = 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПодключениеФНС(ТипПодключения)
	
	Возврат ТипПодключения = 1;
	
КонецФункции

&НаСервереБезКонтекста
Функция БанкиНеПоддерживающиеПередачуНДФЛ()
	
	Возврат Обработки.ПодключениеАУСН.БанкиНеПоддерживающиеПередачуНДФЛ();
	
КонецФункции

&НаКлиенте
Процедура ОтклонитьЗаявкуПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьМетодВФоне("ОтклонитьЗаявку");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьБанкПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьМетодВФоне("ОтключитьБанк");
	КонецЕсли;
	
КонецПроцедуры

#Область ПодключениеЛКАУСН

&НаСервереБезКонтекста
Функция КлючДоступаДействителен(Организация, КлючДоступа)
	
	Возврат ИнтеграцияАУСН.КлючДоступаДействителен(Организация, КлючДоступа);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьТокенПорталаАУСННаСервере(Организация, КлючДоступа)
	
	ИнтеграцияАУСН.ЗаписатьТокенПорталаАУСН(Организация, КлючДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьОтправкуЗапросаНаПодключение()
	
	ИнтеграцияАУСНКлиент.НачатьПолучениеСостоянияКлючаДоступа(Организация, ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПроверкиКлючаДоступа(Результат)
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" И ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		СостояниеКлючаДоступа = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Статус = НРег(СостояниеКлючаДоступа.Статус);
		СтатусыКлючаДоступа = ИнтеграцияАУСНКлиентСервер.СтатусыКлючейДоступа();
		Если Статус = СтатусыКлючаДоступа.Активирован Тогда
			ВыполнитьМетодПодключения();
		ИначеЕсли Статус = СтатусыКлючаДоступа.Проверяется Тогда
			УстановитьСостояниеИнтеграцииЛКАУСН(
				Организация, ПредопределенноеЗначение("Перечисление.СостоянияИнтеграцииАУСН.ПроверкаКлючаДоступа"));
			Оповестить(ИнтеграцияАУСНКлиентСервер.ИмяСобытияПроверкаКлючаДоступа(), Организация, ЭтотОбъект);
			Закрыть();
		Иначе
			УстановитьСостояниеИнтеграцииЛКАУСН(
				Организация, ПредопределенноеЗначение("Перечисление.СостоянияИнтеграцииАУСН.Ошибка"));
			Элементы.ПодсказкаКлючДоступа.Видимость = Истина;
			СостояниеФормы = ВсеСостоянияФормы().ТребуетКлючаДоступа;
			УправлениеФормой(ЭтотОбъект);
			ИнтеграцияАУСНВызовСервера.ЗаписатьПредупреждениеВЖурналРегистрации(
				ИнтеграцияАУСНКлиентСервер.ТекстПредупрежденияНевалидныйКлючДоступа(СостояниеКлючаДоступа.Описание));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМетодПодключения()
	
	Если СостояниеФормы = ВсеСостоянияФормы().Ожидание Тогда
		ПривязатьНалогоплательщикаКВУС();
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы().ТребуетПодтверждения Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьПодключениеСервиса", 30);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьНалогоплательщикаКВУС()
	
	Метод = ИнтеграцияАУСНКлиентСервер.ИменаМетодовВзаимодействияИнтеграцияСЛК().ПривязатьНалогоплательщикаКВУС;
	ДлительнаяОперация = ДлительнаяОперацияНаСервере(Метод);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПривязатьНалогоплательщикаКВУСЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьНалогоплательщикаКВУСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СостояниеФормы = ВсеСостоянияФормы().Ошибка;
		ПредставлениеОшибки = Результат.КраткоеПредставлениеОшибки;
		УправлениеФормой(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ПривязатьНалогоплательщикаКВУСНаСервере(Результат);
	
	Если СостояниеФормы = ВсеСостоянияФормы().ТребуетПодтверждения Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьПодключениеСервиса", 30);
	ИначеЕсли СостояниеФормы = ВсеСостоянияФормы().Подключено Тогда
		Оповестить("ПодключенСервисФНС");
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПривязатьНалогоплательщикаКВУСНаСервере(Результат)
	
	ОтветСервиса = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если ОтветСервиса = Неопределено Тогда
		СостояниеФормы = ВсеСостоянияФормы().Ошибка;
		ПредставлениеОшибки = НСтр("ru = 'Внутренняя ошибка приложения'");
	ИначеЕсли ОтветСервиса.Статус = "Выполнено" Тогда
		// Проверим, текущее состояние подключения
		УстановитьСостояниеФормыПослеПривязкиНалогоплательщикаКВУС();
	ИначеЕсли ОтветСервиса.Статус = "НедействительныйТокен" Тогда
		СостояниеФормы = ВсеСостоянияФормы().ТребуетКлючаДоступа;
		Элементы.ПодсказкаКлючДоступа.Видимость = Истина;
		УправлениеФормой(ЭтотОбъект);	
	Иначе
		СостояниеФормы = ВсеСостоянияФормы().Ошибка;
		ПредставлениеОшибки = ОтветСервиса.Сообщение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеСервиса()
	
	Метод = ИнтеграцияАУСНКлиентСервер.ИменаМетодовВзаимодействияИнтеграцияСЛК().ПолучитьСтатусЗаявкиНаПодключение;
	ДлительнаяОперация = ДлительнаяОперацияНаСервере(Метод);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверкаЗаявкиЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаявкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПредставлениеОшибки = Результат.КраткоеПредставлениеОшибки;
		СостояниеФормы = ВсеСостоянияФормы().Ошибка;
	Иначе
		ПроверкаЗаявкиНаСервере(Результат);
	КонецЕсли;
	
	Если СостояниеФормы = ВсеСостоянияФормы().Подключено Тогда
		ОтключитьОбработчикОжидания("Подключаемый_ПроверитьПодключениеСервиса");
		Оповестить("ПодключенСервисФНС");
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаявкиНаСервере(Результат)
	
	ОтветСервиса = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если ОтветСервиса = Неопределено Тогда
		СостояниеФормы = ВсеСостоянияФормы().Ошибка;
		ПредставлениеОшибки = НСтр("ru = 'Внутренняя ошибка приложения'");
	ИначеЕсли ОтветСервиса.Статус = "Выполнено" Тогда
		УстановитьСостояниеФормыПослеПривязкиНалогоплательщикаКВУС();
	Иначе
		СостояниеФормы = ВсеСостоянияФормы().Ошибка;
		ПредставлениеОшибки = ОтветСервиса.Сообщение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияНаСервере(Метод)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Организация", Организация);
	ПараметрыПроцедуры.Вставить("МетодВзаимодействия", Метод);
	
	Возврат ИнтеграцияАУСН.ВыполнитьВФоне(ПараметрыПроцедуры, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьПодключениеСервиса()
	
	ПроверитьПодключениеСервиса();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеФормыПослеПривязкиНалогоплательщикаКВУС()
	
	СостояниеПодключения = СостояниеПодключенияОрганизации(Организация);
	КлючДоступа = ИнтеграцияАУСН.ТокенПорталаАУСН(Организация);
	Если ЗначениеЗаполнено(КлючДоступа) И Не ИнтеграцияАУСН.КлючДоступаДействителен(Организация, КлючДоступа) Тогда
		КлючДоступа = "";
	КонецЕсли;
	
	Если СостояниеПодключения = Перечисления.СостоянияИнтеграцииАУСН.Подключено Тогда
		СостояниеФормы = ВсеСостоянияФормы().Подключено;
	ИначеЕсли СостояниеПодключения = Перечисления.СостоянияИнтеграцииАУСН.ТребуетПодтвержденияВЛичномКабинете Тогда
		СостояниеФормы = ВсеСостоянияФормы().ТребуетПодтверждения;
	ИначеЕсли Не ЗначениеЗаполнено(КлючДоступа)
		Или СостояниеПодключения = Перечисления.СостоянияИнтеграцииАУСН.Отсутствует Тогда
		СостояниеФормы = ВсеСостоянияФормы().ТребуетКлючаДоступа;
	ИначеЕсли СостояниеПодключения = Перечисления.СостоянияИнтеграцииАУСН.Ошибка Тогда
		СостояниеФормы = ВсеСостоянияФормы().Ошибка;
	Иначе
		СостояниеФормы = ВсеСостоянияФормы().Ожидание;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеПодключенияОрганизации(Знач Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияИнтеграцииАУСН.Состояние
	|ИЗ
	|	РегистрСведений.СостоянияИнтеграцииАУСН КАК СостоянияИнтеграцииАУСН
	|ГДЕ
	|	СостоянияИнтеграцииАУСН.Организация = &Организация
	|	И СостоянияИнтеграцииАУСН.Банк = ЗНАЧЕНИЕ(Справочник.КлассификаторБанков.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	Иначе
		Возврат Перечисления.СостоянияИнтеграцииАУСН.Отсутствует;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОчиститьКлючДоступаНаСервере(Организация)
	
	ИнтеграцияАУСН.ОчиститьКлючДоступаЛКФНС(Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеБанка

&НаКлиенте
Процедура ВыполнитьМетодВФоне(Метод)
	
	ПараметрыМетода = ПараметрыВыполненияМетода(Метод);
	ДлительнаяОперация = ВыполнитьМетодВФонеНаСервере(ПараметрыМетода, УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МетодИзменяетСостояниеИнтеграции(Метод) Тогда
		УстановитьСостояниеФормы(ВсеСостоянияФормы().Ожидание, ЭтотОбъект);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Метод", Метод);
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ДополнительныеПараметры.Вставить("Банк", Банк);
	ДополнительныеПараметры.Вставить("КодЗаявки", КодЗаявки);
	
	Обработчик = Новый ОписаниеОповещения("ОбработкаВыполненияМетода", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыВыполненияМетода(Метод)
	
	ПараметрыМетода = ИнтеграцияАУСНКлиентСервер.НовыеПараметрыМетодаВзаимодействия(Метод);
	Если ПараметрыМетода.Свойство("ИдентификаторБанка") И Не ЗначениеЗаполнено(ИдентификаторБанка) Тогда
		ИдентификаторБанка = ИнтеграцияАУСНВызовСервераПовтИсп.ИдентификаторБанкаПоКлассификатору(Банк);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ПараметрыМетода, ЭтотОбъект);
	
	Если Метод = "НайтиЗаявку" И ПараметрыМетода.Свойство("КодЗаявки") тогда
		ПараметрыМетода.КодЗаявки = КодЗаявкиВведенныйТекст;
	КонецЕсли;
	
	Возврат ПараметрыМетода;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьМетодВФонеНаСервере(Знач ПараметрыМетода, Знач ИдентификаторФормы)
	
	Возврат ИнтеграцияАУСН.ВыполнитьВФоне(ПараметрыМетода, ИдентификаторФормы);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыполненияМетода(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = ОтветМетода(Результат, ДополнительныеПараметры.Метод);
	
	Если Ответ <> Неопределено Тогда
		ОбработкаОтветаМетода(Ответ, ДополнительныеПараметры);
	Иначе
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОтветМетода(Результат, Метод)

	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Если МетодИзменяетСостояниеИнтеграции(Метод) Тогда
			ПредставлениеОшибки = Результат.КраткоеПредставлениеОшибки;
			УстановитьСостояниеФормы(ВсеСостоянияФормы().Ошибка, ЭтотОбъект);
		КонецЕсли;
		ЗаписатьОшибкуВЖурналРегистрации(
			Результат.КраткоеПредставлениеОшибки,
			Результат.ПодробноеПредставлениеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		Возврат ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОтветаМетода(Ответ, ДополнительныеПараметры)
	
	СтатусыЗапросов = ИнтеграцияАУСНКлиентСервер.СтатусыЗапросов();
	
	Если Ответ.Статус = СтатусыЗапросов.Выполнено Тогда
		
		Если ДополнительныеПараметры.Метод = "НайтиЗаявку" Тогда
			ОбработатьОтвет_НайтиЗаявку(Ответ.Результат, ДополнительныеПараметры);
		ИначеЕсли ДополнительныеПараметры.Метод = "ПодтвердитьЗаявку" Тогда
			ОбработатьОтвет_ПодтвердитьЗаявку(Ответ.Результат, ДополнительныеПараметры);
		ИначеЕсли ДополнительныеПараметры.Метод = "ОтклонитьЗаявку" Тогда
			ОбработатьОтвет_ОтклонитьЗаявку(Ответ.Результат, ДополнительныеПараметры);
		ИначеЕсли ДополнительныеПараметры.Метод = "ОтключитьБанк" Тогда
			ОбработатьОтвет_ОтключитьБанк(ДополнительныеПараметры);
		КонецЕсли;
		
		ЗаполнитьСписокВыбораБанка();
		
		УправлениеФормой(ЭтотОбъект);
		
	ИначеЕсли Ответ.Статус = СтатусыЗапросов.Ошибка Тогда
		
		КодСостояния = Ответ.КодСостояния;
			
		Если КодСостояния = 401 И ИнтернетПоддержкаПользователейКлиент.ДоступноПодключениеИнтернетПоддержки() Тогда
			
			// Требуется подключение к Порталу
			ОтобразитьПодключениеКПорталу(ДополнительныеПараметры.Метод, Ответ);
			
		Иначе
			
			Если МетодИзменяетСостояниеИнтеграции(ДополнительныеПараметры.Метод) Тогда
				Если ЗначениеЗаполнено(Ответ.Сообщение) Тогда
					ПредставлениеОшибки = Ответ.Сообщение;
				Иначе
					ПредставлениеОшибки = СтрШаблон(
						НСтр("ru='Ошибка при вызове метода %1, код %2.'"),
						ДополнительныеПараметры.Метод,
						Ответ.КодСостояния);
				КонецЕсли;
				
				УстановитьСостояниеФормы(ВсеСостоянияФормы().Ошибка, ЭтотОбъект);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуВЖурналРегистрации(Знач КраткоеПредставлениеОшибки, Знач ПодробноеПредставлениеОшибки)
	
	ИнтеграцияАУСН.ЗаписатьОшибкуВЖурналРегистрации(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПодключениеКПорталу(Метод = "", Ответ = Неопределено)
	
	ИмяОбработчикаЗавершения = "Подключаемый_ЗавершитьОбработкуОшибки";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Метод", Метод);
	ДополнительныеПараметры.Вставить("Ответ", Ответ);
	ДополнительныеПараметры.Вставить("ФормаВладелец" , ЭтотОбъект);
	ОбработчикЗавершения = Новый ОписаниеОповещения(ИмяОбработчикаЗавершения, ЭтотОбъект, ДополнительныеПараметры);
	ИнтеграцияАУСНКлиент.ОтобразитьПодключениеКПорталу(ОбработчикЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗавершитьОбработкуОшибки(Результат, ПараметрыЗавершения) Экспорт
	
	Если Результат.Действие = "Повторить" Тогда
		
		ВыполнитьМетодВФоне(ПараметрыЗавершения.Метод);
		
	Иначе
		
		ВернутьсяКПодключениюБанка();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКПодключениюБанка()
	
	КодЗаявки = "";
	КодЗаявкиОбработатьИзменение();
	УстановитьСостояниеФормы(ВсеСостоянияФормы().Подключение, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтвет_НайтиЗаявку(Результат, ПараметрыМетода)
	
	КодНайденнойЗаявки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "requestUeid", "");
	РеквизитыБанковскихСчетов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "bankAccounts", Новый Массив);
	
	КодЗаявкиПроверен = КодНайденнойЗаявки = КодЗаявкиВведенныйТекст
		И ПроверитьРеквизитыБанковскихСчетов(РеквизитыБанковскихСчетов);
	
	Если КодЗаявкиПроверен Тогда
		
		Если РеквизитыБанковскихСчетов.Количество() > 0 Тогда
			ДобавитьСчета(РеквизитыБанковскихСчетов);
		КонецЕсли;
		
		СтатусЗаявки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "status", "");
		НаименованиеБанка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "bankName", "");
		КодЗаявкиПодсказка = ИнтеграцияАУСНФормыКлиент.ПодсказкаКодаЗаявки(
			КодЗаявкиВведенныйТекст, СтатусЗаявки, НаименованиеБанка);
		
	Иначе
		
		КодЗаявкиПодсказка = ИнтеграцияАУСНФормыКлиент.ПодсказкаНекорректногоКодаЗаявки();
	
	КонецЕсли;
	
	СостояниеФормы = ВсеСостоянияФормы().Подключение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтвет_ПодтвердитьЗаявку(Результат, ПараметрыМетода)
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Попытка
			НовоеСостояниеИнтеграции = ЗаписатьСостояниеИнтеграцииПриПодключении(
				ПараметрыМетода.Организация, ПараметрыМетода.Банк, ПараметрыМетода.КодЗаявки, Результат);
		Исключение
			ПредставлениеОшибки = СтрШаблон(НСтр("ru = 'Подключение не завершено'"));
			СостояниеФормы = ВсеСостоянияФормы().Ошибка;
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Если НовоеСостояниеИнтеграции = Неопределено Тогда
		// Состояние не изменилось, возвращаем форму к исходному состоянию
		СостояниеФормы = ВсеСостоянияФормы().Подключение;
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Банк", ПараметрыМетода.Банк);
	СтрокиУполномоченныеБанки = УполномоченныеБанки.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаУполномоченныйБанк Из СтрокиУполномоченныеБанки Цикл
		СтрокаУполномоченныйБанк.Подключен = Истина;
	КонецЦикла;
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.СостоянияИнтеграцииАУСН"));
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Банк", Банк);
	ПараметрыОповещения.Вставить("СервисПодключен", Истина);
	Оповестить("ИнтеграцияАУСН_ПодключенБанк", ПараметрыОповещения);
	
	СостояниеФормы = ВсеСостоянияФормы().Подключено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтвет_ОтклонитьЗаявку(Результат, ПараметрыМетода)
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НовоеСостояниеИнтеграции = ЗаписатьСостояниеИнтеграцииПриПодключении(
			ПараметрыМетода.Организация, ПараметрыМетода.Банк, ПараметрыМетода.КодЗаявки, Результат);
	КонецЕсли;
	
	Если НовоеСостояниеИнтеграции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеФормы = ВсеСостоянияФормы().ЗаявкаОтклонена;
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("Организация", ПараметрыМетода.Организация);
	ПараметрОповещения.Вставить("Банк ", ПараметрыМетода.Банк);
	Оповестить("ИнтеграцияАУСН_ИзмененоСостояние", ПараметрОповещения);
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.СостоянияИнтеграцииАУСН"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтвет_ОтключитьБанк(ПараметрыМетода)
	
	НовоеСостояниеИнтеграции = ЗаписатьСостояниеИнтеграцииПриОтключении(ПараметрыМетода.Организация, ПараметрыМетода.Банк);
	
	Если НовоеСостояниеИнтеграции = Неопределено Тогда
		// Состояние не изменилось, возвращаем форму к исходному состоянию
		СостояниеФормы = ВсеСостоянияФормы().Подключение;
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Банк", ПараметрыМетода.Банк);
	СтрокиУполномоченныеБанки = УполномоченныеБанки.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаУполномоченныйБанк Из СтрокиУполномоченныеБанки Цикл
		СтрокаУполномоченныйБанк.Подключен = Ложь;
	КонецЦикла;
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.СостоянияИнтеграцииАУСН"));
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("Организация", ПараметрыМетода.Организация);
	ПараметрОповещения.Вставить("Банк", ПараметрыМетода.Банк);
	Оповестить("ИнтеграцияАУСН_ОтключенБанк", ПараметрОповещения);
	
	СостояниеФормы = ВсеСостоянияФормы().Подключение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МетодИзменяетСостояниеИнтеграции(Метод)
	
	Возврат МетодыИзменяющиеСостояниеИнтеграции().Найти(Метод) <> Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МетодыИзменяющиеСостояниеИнтеграции()
	
	Методы = Новый Массив;
	Методы.Добавить("ПодтвердитьЗаявку");
	Методы.Добавить("ОтклонитьЗаявку");
	Методы.Добавить("ОтключитьБанк");
	
	Возврат Методы;
	
КонецФункции

&НаКлиенте
Функция ПроверитьРеквизитыБанковскихСчетов(РеквизитыБанковскихСчетов) 
	
	Если РеквизитыБанковскихСчетов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	БИКВыбранногоБанка = БИКБанка(Банк);
	
	ВГраница = РеквизитыБанковскихСчетов.ВГраница();
	Для Индекс = 0 По ВГраница Цикл
		РеквизитыБанковскогоСчета = РеквизитыБанковскихСчетов[ВГраница - Индекс];
		Если ТипЗнч(РеквизитыБанковскогоСчета) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		БИКБанковскогоСчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыБанковскогоСчета, "bic", "");
		Если БИКВыбранногоБанка <> БИКБанковскогоСчета Тогда
			РеквизитыБанковскихСчетов.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыБанковскихСчетов.Количество() = 0 Тогда
		// Не осталось ни одного правильного счета
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ДобавитьСчета(БанковскиеСчета)
	
	Рубль = Справочники.Валюты.НайтиПоКоду(БанковскиеПравила.КодРубляВНомереСчета());
	СчетаОрганизации = Справочники.БанковскиеСчета.БанковскиеСчетаОрганизации(Организация, Рубль); 
	БИКВыбранногоБанка = БИКБанка(Банк);
	
	Для Каждого СтрокаБанковскийСчет Из БанковскиеСчета Цикл
		
		Если СтрокаБанковскийСчет.bic <> БИКВыбранногоБанка Тогда 
			Продолжить;
		КонецЕсли;
		
		БанкСсылка = БанкПоБИК(СтрокаБанковскийСчет.bic);
		НомерСчета = СтрокаБанковскийСчет.accountNumber;
		Счет =  Справочники.БанковскиеСчета.БанковскийСчетПоРеквизитам(Организация, БанкСсылка, НомерСчета);
			
		Если ЗначениеЗаполнено(Счет) Тогда
			
			СчетПомеченНаУдаление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "ПометкаУдаления");
			Если СчетПомеченНаУдаление Тогда
				СчетОбъект = Счет.ПолучитьОбъект();
				СчетОбъект.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		НаименованиеБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанкСсылка, "Наименование");
		
		НовыйБанковскийСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
		НовыйБанковскийСчет.Банк = БанкСсылка;
		НовыйБанковскийСчет.НомерСчета = НомерСчета;
		НовыйБанковскийСчет.Наименование = БанковскиеСчетаФормыКлиентСервер.НаименованиеБанковскогоСчета(
			НовыйБанковскийСчет, НаименованиеБанка);
			
		Если БанковскиеПравила.ЭтоРублевыйСчет(НомерСчета) Тогда
			НовыйБанковскийСчет.ВалютаДенежныхСредств = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			НовыйБанковскийСчет.Валютный = Ложь;
			
			ОсновнойБанковскийСчетОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Организация, "ОсновнойБанковскийСчет");
			
			Если Не ЗначениеЗаполнено(ОсновнойБанковскийСчетОрганизации) И СчетаОрганизации.Количество() = 0 Тогда
				НовыйБанковскийСчетСсылка = Справочники.БанковскиеСчета.ПолучитьСсылку();
				УстановитьОсновнойСчетОрганизации(НовыйБанковскийСчетСсылка);
				НовыйБанковскийСчет.УстановитьСсылкуНового(НовыйБанковскийСчетСсылка);
			Иначе
				// Проверяем и включаем ФО ИспользоватьНесколькоБанковскихСчетовОрганизации.
				БанковскиеСчетаВызовСервера.ПроверитьИспользованиеНесколькоБанковскихСчетов(Организация);
			КонецЕсли;
		Иначе
			КодВалюты = БанковскиеПравила.КодВалютыБанковскогоСчета(НомерСчета);
			НовыйБанковскийСчет.ВалютаДенежныхСредств = БанковскиеСчетаВызовСервера.ПолучитьВалютуПоКоду(КодВалюты);
			НовыйБанковскийСчет.Валютный = Истина;
		КонецЕсли;
		
		НовыйБанковскийСчет.Владелец = Организация;
		НовыйБанковскийСчет.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция БИКБанка(Знач Банк)
	
	Если ЗначениеЗаполнено(Банк) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Код");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция БанкПоБИК(БИК)
	
	Банк = Справочники.Банки.ПустаяСсылка();
	
	КлассификаторБанка = РаботаСБанкамиБП.СсылкаПоКлассификатору(БИК);
	МассивКлассификаторовБанков = Новый Массив;
	МассивКлассификаторовБанков.Добавить(КлассификаторБанка);
	МассивБанков = РаботаСБанкамиБП.ПодобратьБанкИзКлассификатора(МассивКлассификаторовБанков);
	
	Если МассивБанков.Количество() > 0 Тогда
		Банк = МассивБанков[0];
	КонецЕсли;
	
	Возврат Банк;
	
КонецФункции

&НаСервере
Процедура УстановитьОсновнойСчетОрганизации(НовыйБанковскийСчетСсылка)
	
	ОрганизацияОбъект = Организация.ПолучитьОбъект();
	ОрганизацияОбъект.Заблокировать();
	ОрганизацияОбъект.ОсновнойБанковскийСчет = НовыйБанковскийСчетСсылка;
	ОрганизацияОбъект.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьСостояниеИнтеграцииПриПодключении(Организация, Банк, КодЗаявки, РезультатВыполнения)
	
	Если КодЗаявки <> ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыполнения, "requestUeid", "") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтатусЗаявки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыполнения, "status", "");
	Если СтатусЗаявки = ИнтеграцияАУСНКлиентСервер.СтатусыЗаявокПодключения().Принята Тогда
		СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииАУСН.Подключено;
	ИначеЕсли СтатусЗаявки = ИнтеграцияАУСНКлиентСервер.СтатусыЗаявокПодключения().Отклонена Тогда
		СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииАУСН.Отсутствует;
	Иначе
		ПредставлениеОшибки = СтрШаблон(НСтр("ru = 'Сервер вернул некорректный статус заявки: %1'"), СтатусЗаявки);
		ЗаписатьОшибкуВЖурналРегистрации(ПредставлениеОшибки, ПредставлениеОшибки);
		ВызватьИсключение ПредставлениеОшибки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СостояниеИнтеграции) Тогда
		Результат = РегистрыСведений.СостоянияИнтеграцииАУСН.ЗаписатьСостояниеИнтеграции(
			Организация, Банк, СостояниеИнтеграции, КодЗаявки);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат ?(Результат, СостояниеИнтеграции, Неопределено);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьСостояниеИнтеграцииПриОтключении(Организация, Банк)
	
	СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииАУСН.Отключено;
	
	Результат = РегистрыСведений.СостоянияИнтеграцииАУСН.ЗаписатьСостояниеИнтеграции(
		Организация, Банк, СостояниеИнтеграции);
	
	Возврат ?(Результат, СостояниеИнтеграции, Неопределено);
	
КонецФункции

#КонецОбласти

#КонецОбласти
